Revit 2016 API
Face Properties
The Face type exposes the following members.
Properties
Name | Description
Area
The area of this face.
EdgeLoops
Each edge loop is a closed boundary of the face.
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
HasRegions
Reports if the face contains regions created with the Split Face command.
IsCyclic
The boolean value that indicates whether this face is periodic in the specified parametric direction.
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsTwoSided
Determines if a face is two-sided (degenerate)
MaterialElementId
Element ID of the material from which this face is composed.
Period
The period of this face in the specified parametric direction.
Reference
Returns a stable reference to the face.
Visibility
The visibility.
 (Inherited from GeometryObject.)
See Also
Face Class
Autodesk.Revit.DB Namespace